app/controllers/api/questions_controller.rb

    def index
        # debugger
        @questions = Question.all.includes(:asker)
---
SELECT "questions".* FROM "questions"

    def show
        @question = Question.find_by(id: params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @question = Question.new(question_params)
        @question.asker = current_user
        if @question.save
---
INSERT INTO "questions" ("asker_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["asker_id", 1], ["title", "mnvcxzvcxz"], ["body", "awdfawef"], ["created_at", "2023-04-03 16:12:24.801164"], ["updated_at", "2023-04-03 16:12:24.801164"]]

    def destroy
        @question = Question.find_by(id: params[:id])
        @current_user = current_user
        if @question.asker.id == @current_user.id
            @question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 32]]