app/controllers/application_controller.rb

    def current_user
        # debugger
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

    def test
        if params.has_key?(:login)
          login!(User.first)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]